function [ TE ] = Fkine(theta)
%Fkine 为PUMA560的运动学正解求解程序
%程序的求解是基于指数积变换
%  输入theta为1x6的矩阵，对应着留个关节的关节角
%  输出TE为选定的工具坐标系相对于惯性系的变换矩阵
%% 连杆参数的设定
a2=0.4318;
a3=0.0203;
d2=0.15005;
d4=0.4318;
%% 连杆旋量的建立和求解
%r为各个连杆的轴线经过的点
r=cell(1,6);
r{1}=[0 0 0]';
r{2}=[-d2 0 0]';
r{3}=[-d2 a2 0]';
r{4}=[-d2 a2+d4 a3]';
r{5}=[-d2 a2+d4 a3]';
r{6}=[-d2 a2+d4 a3]';
%w为各个轴线的旋转轴的方向
w=cell(1,6);
w{1}=[0 0 1]';
w{2}=[-1 0 0]';
w{3}=[-1 0 0]';
w{4}=[0 1 0]';
w{5}=[-1 0 0]';
w{6}=[0 0 1]';
%tw为旋量，T为各个旋量对应角度的变换矩阵
tw=cell(1,6);
T=cell(1,6);
for i=1:6
    tw{i}=Twist('R',w{i},r{i});
    T{i}=tw{i}.T(theta(i)); %各个旋量对应变换矩阵的求解
end
%% TE的求解
T0=SE3(-d2,a2+d4,a3);%初始形位下的工具坐标系相对于惯性系的变换矩阵
TE=T{1}*T{2}*T{3}*T{4}*T{5}*T{6}*T0.T;
end

